[
    {
      "Title":"Stretch Skinny Jeans",
      "Subtitle":"You can do everything in these jeans",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/stretch-skinny-jeans-dark-blue-999204628511",
      "Description":"Jeans are one of those desert island items. You probably can remember your first pair, and apparently every person has at least six in their wardrobe. If you like your skinny style, this pair will not let you down on that front, close fitting and made with stretch cotton, they feature belt loops, five pockets, a concealed front zip fly and a faded gradient wash. You should own these stretch skinnies, because we've tried them out and you can do anything you want in them.",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Jeans",
      "Colour":"Dark Blue",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/999204628511_01",
      "Price":12.0
    },
    {
      "Title":"Crew Neck Regular Fit T-shirt",
      "Subtitle":"This top is the wardrobe staple you can’t live without. Product made using a minimum of 50% cotton from the Primark sustainable cotton programme",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/crew-neck-regular-fit-t-shirt-black-991058687804",
      "Description":"It really doesn’t get more essential than the crew neck T-shirt! Not only does it offer a timeless style, it can form the basis of endless trendy outfits. Cut for a regular fit, it's made from a soft material and has short sleeves for everyday comfort. Thanks to its versatility, it can carry your wardrobe from season to season and can be styled to suit multiple occasions. Wear it over jeans with trainers for a relaxed off-duty outfit, or you can dress it up by tucking it into chinos and pairing it with boots and a blazer for a sophisticated look.",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Tops & T-Shirts",
      "Colour":"Black",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991058687804_01",
      "Price":2.5
    },
    {
      "Title":"Utility Bucket Hat",
      "Subtitle":"This bucket hat brings a touch of  style and practicality to your wardrobe",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/utility-bucket-hat-black-991057601804",
      "Description":"Sometimes you need a piece of clothing that looks great and brings some practicality to your day. This bucket hat is the perfect combination of utility and design that can be taken out and about for any occasion. The crown of the hat features a series of pockets and hanging loops that bring a hardwearing look to the piece whilst the angled rim helps to protect the eyes from the sun and finishes off the bucket hat look we all know and love.",
      "Gender":"Men",
      "Category":"Accessories",
      "Subcategory":"Hats, Gloves & Scarves",
      "Colour":"Black",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991057601804_01",
      "Price":7.0
    },
    {
      "Title":"Crew Neck Stretch T-shirt",
      "Subtitle":"This crew neck tee is a must-have essential. Product made using a minimum of 50% cotton from the Primark Sustainable Cotton Programme",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/crew-neck-stretch-t-shirt-black-991058582804",
      "Description":"It's not a stretch to say that a rotation of wardrobe essentials is the way to go when you want some effortless style wins. This crewneck tee is an excellent foundation for various looks. It is designed with a stretchy fabric to keep the fit comfortable if you're at the gym or just relaxing. The block colour, short sleeves, and neckline create an understated look that can tie other clothing pieces into an outfit. Going for a casual feel? Choose shorts, jeans and casual shoes. If you want something smarter, wear chinos and a jacket. With this tee, you can build an outfit for all occasions.",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Tops & T-Shirts",
      "Colour":"Black",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991058582804_01",
      "Price":4.0
    },
    {
      "Title":"Memory Foam Lace Trainers",
      "Subtitle":"Trendy trainers that deliver everyday comfort",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/memory-foam-lace-trainers-navy-991024659528",
      "Description":null,
      "Gender":"Men",
      "Category":"Shoes",
      "Subcategory":"Trainers",
      "Colour":"Navy",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991024659528_01",
      "Price":18.0
    },
    {
      "Title":"Stretch Slim Fit Jeans",
      "Subtitle":"For fit, style and comfort, this denim is jean-ius",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/stretch-slim-fit-jeans-light-blue-999205020504",
      "Description":"Finding the perfect pair of jeans is similar to online dating, it can be hard to find the one. There are the ones you think might be it, they look buff, but there’s no chemistry between you two. Well, we’ll save you time, as these light-wash slim fit jeans are definitely the one. Made with stretch cotton, they’re flexible, and with five pockets you know you’ll be giving them some of your possessions before long. Accessories look great on them too, as they have loops to add a belt. Complete with a button and concealed fastening at the front, forget finding the one before the one.",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Jeans",
      "Colour":"Light Blue",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/999205020504_01",
      "Price":12.0
    },
    {
      "Title":"Short Sleeve Marseille T-shirt",
      "Subtitle":"Bring the vibes of southern France to your wardrobe with this tee! Product made using a minimum of 50% cotton from the Primark Sustainable Cotton Programme",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/short-sleeve-marseille-t-shirt-ecru-991058510108",
      "Description":"Evoke memories of travel and the sun with this great t-shirt. This tee is a great wardrobe piece for any weather, featuring a simple but effective block colour with a blue label-like design. The short sleeves and rounded neckline add a familiar shape and silhouette to give you a great foundation piece for an array of outfits enhanced by the light and comfortable material. Pair with jeans or shorts for a sporty, casual look or with jeans and chinos when you are looking for an out-and-about outfit that's not too fussy but still looks great.",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Tops & T-Shirts",
      "Colour":"Ecru",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991058510108_01",
      "Price":3.0
    },
    {
      "Title":"Crew Neck Regular Fit T-shirt",
      "Subtitle":"A wardrobe staple with all occasion possibility",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/crew-neck-regular-fit-t-shirt-grey-marl-991059244720",
      "Description":"Open your wardrobe to a world of styling possibilities with this tee. with short sleeves and a rounded neckline, this is a top with a familiar style and endless potential. Manufactured from a soft, warm and stretchy material, you can expect a comfortable fit for any occasion. Pair with jeans or chinos for a casual look that's great for any occasion. If you want a more sporty feel, go with joggers or shorts. Layer with an overshirt to add depth to an outfit, or with a jacket or hoodie when you want something for on the go.",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Tops & T-Shirts",
      "Colour":"Grey Marl",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991059244720_01",
      "Price":2.5
    },
    {
      "Title":"Cuffed Denim Joggers",
      "Subtitle":"An ideal combination of jeans and joggers for your everyday wardrobe",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/cuffed-denim-joggers-black-991040280804",
      "Description":"Combining the durability of denim with the comfort of joggers, these trousers are a hybrid piece for any lifestyle. The rips at the knees give them a more casual feel that's suitable for hanging out with friends or running everyday errands. The elasticated waistband provides that signature jogger fit that you can adjust with a drawstring. Pair with a favourite T-shirt and overshirt to go out and about, or wear a hoodie for a more relaxed feel.",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Jeans",
      "Colour":"Black",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991040280804_01",
      "Price":20.0
    },
    {
      "Title":"Solid Colour Cap",
      "Subtitle":"Create a sporty style from head to toe with this cap",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/solid-colour-cap-navy-991057741528",
      "Description":"Sometimes the smallest accessory can set the whole tone for an outfit, and this block colour cap could be the finishing touch you're looking for. The solid colour provides a simple but effective look that lets the piece's construction shine. The top of the hat is designed to sit comfortably on the head. Each panel has a vent to help cool you as you keep active. Pair with your favourite tees and joggers for a sporty look that's great for going out with friends or being relaxed. Choose some of our varsity-style pieces to achieve that complete American sports look.",
      "Gender":"Men",
      "Category":"Accessories",
      "Subcategory":"Hats, Gloves & Scarves",
      "Colour":"Navy",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991057741528_01",
      "Price":3.0
    },
    {
      "Title":"Cotton Piqué Polo Shirt",
      "Subtitle":"Keep it classy with this stylish polo shirt, perfect for any social plans",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/cotton-pique-polo-shirt-cobalt-991025688518",
      "Description":"The classic cotton piqué polo shirt has been updated with contrasting trims for a fashion-forward, contemporary smart-casual ensemble. Wasn’t that sentence simply music to your ears? Yeah, we thought so. This understated top truly is the hallmark of attire that can seamlessly transition between sophisticated events and laid-back weekends, so adding at least one iteration to your wardrobe is a must. With a spread collar trimmed with stripes, signature three-button placket, and short sleeves framed with contrasting details, this polo shirt features the expected elements of the style with a gently refreshed appearance. The classic cotton piqué fabrication aims to ensure comfortable wear that’s breathable and lightweight, while adding a touch of tactile intrigue. Which colour will you be choosing first?",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Tops & T-Shirts",
      "Colour":"Cobalt",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991025688518_01",
      "Price":7.0
    },
    {
      "Title":"Triple Pocket Crossbody Messenger Bag",
      "Subtitle":"A messenger bag with three big pockets, ideal for carrying your essentials",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/triple-pocket-crossbody-messenger-bag-black-991052749804",
      "Description":"When you're on the go and have a lot to take, this double-pocket shoulder bag will greatly help. The material is designed to be hard-wearing and robust, able to carry around your essentials as you travel between home, work, the gym, or just running errands. The bag has two deep front pockets and one main section with enough room for your phone, wallet and other essentials for the day. Each section can be zipped-up to protect your belongings safely and securely. An adjustable strap connects to each end of the bag and can be easily carried over the shoulder as you set out for your day.",
      "Gender":"Men",
      "Category":"Accessories",
      "Subcategory":"Bags & Wallets",
      "Colour":"Black",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991052749804_01",
      "Price":6.0
    },
    {
      "Title":"Mesh Regular Fit T-shirt",
      "Subtitle":"This light and airy tee is a great wardrobe upgrade",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/mesh-regular-fit-t-shirt-charcoal-991060782716",
      "Description":"If, like us, you're forever on the hunt for new T-shirt designs, this charcoal perforated tee is a great choice for when you want to upgrade your collection while maintaining your signature casual style. The short sleeves and rounded neckline create a straightforward look, enhanced by the patch pocket on the chest and the all-over perforated top layer that gives it a sporty chic vibe. Pair with shorts and chinos for a cool summer look, or with joggers for relaxing at home.",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Tops & T-Shirts",
      "Colour":"Charcoal",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991060782716_01",
      "Price":7.0
    },
    {
      "Title":"Utility Bucket Hat",
      "Subtitle":"Combining style and function, this  hat will be a quick favourite of yours! PProduct made using a minimum of 50% Recycled Nylon",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/utility-bucket-hat-grey-991057609706",
      "Description":"Sometimes you need a piece of clothing that looks great and brings some practicality to your day. This bucket hat is the perfect combination of utility and design that can be taken out and about for any occasion. The crown of the hat features a series of pockets and hanging loops that bring a hardwearing look to the piece, whilst the angled rim helps to protect the eyes from the sun and finishes off the bucket hat look we all know and love.",
      "Gender":"Men",
      "Category":"Accessories",
      "Subcategory":"Hats, Gloves & Scarves",
      "Colour":"Grey",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991057609706_01",
      "Price":7.0
    },
    {
      "Title":"Panelled Low-Top Trainers",
      "Subtitle":"Keep it box-fresh in these cool creps",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/panelled-low-top-trainers-white-991037181002",
      "Description":"Keep your feet looking fresh and feel extra comfy in these sneakers. Shaped with a round toe, they feature perforated holes in the front, a lace-up silhouette, padded heels tabs and chunky soles. Team them with tees, shirts, joggers, jeans and tailored trousers. Your options are endless with this pair.",
      "Gender":"Men",
      "Category":"Shoes",
      "Subcategory":"Trainers",
      "Colour":"White",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991037181002_01",
      "Price":14.0
    },
    {
      "Title":"Regular Fit Crew Neck T-shirt",
      "Subtitle":"This tee is a simple wardrobe staple. Product made using a minimum of 50% cotton from the Primark Sustainable Cotton Programme",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/regular-fit-crew-neck-t-shirt-white-991059651002",
      "Description":"With this tee, we have removed anything unnecessary to create a comfortable and well-fitting top. Suitable for all occasions, this piece effortlessly merges into your existing wardrobe. The short sleeves and crew neck create a familiar frame that can stand alone or be paired with other clothes. Made from a comfortable and stretchy cotton blend, this will be a go-to option when you want a quick and easy style triumph. Pair with jeans or cargo trousers when you want a casual, laidback look or joggers for something more relaxed. Layer with a blazer, jacket or hoodie, depending on the occasion and weather.",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Tops & T-Shirts",
      "Colour":"White",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991059651002_01",
      "Price":4.0
    },
    {
      "Title":"London Varsity T-shirt",
      "Subtitle":"Bring sporty vibes to your wardrobe with this great tee",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/london-varsity-t-shirt-navy-991059675528",
      "Description":"Add a sporty vibe with a British twist to your wardrobe with this London varsity tee. Displaying a white, sporty logo on a blue background, this is a fun addition to your collection. The short sleeves and rounded neckline create a well-fitting piece that will look great in various outfits. The soft, comfortable material allows some movement, making this ideal for jogging or going to the gym. Pair with shorts or joggers when heading gymward or out and about, or choose chinos for something more casual. Go with jeans and a varsity jacket for the all-American sports feel.Varsity\n",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Tops & T-Shirts",
      "Colour":"Navy",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991059675528_01",
      "Price":3.0
    },
    {
      "Title":"Pullover Long Sleeve Hoodie",
      "Subtitle":"A hoodie to boost your essentials wardrobe",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/pullover-long-sleeve-hoodie-white-991056588002",
      "Description":"Brighten up your essentials wardrobe with this pullover hoodie! It adds a pop of colour and interest to the most casual outfits. With long sleeves, a kangaroo pocket and drawstring hood, this white hoodie maintains a familiar look and feel. The cotton blend material is designed to be warm and comfortable while giving you enough freedom to move about as usual. Pair with joggers or shorts for a casual, sporty feel or with chinos to elevate your weekend looks.",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Hoodies & Sweatshirts",
      "Colour":"White",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991056588002_01",
      "Price":9.0
    },
    {
      "Title":"Roll Top Hiking Backpack",
      "Subtitle":"Dusty old rucksack - we say take a hike",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/roll-top-hiking-backpack-black-991012048804",
      "Description":"Our recycled polyester roll-top backpack strikes the right balance between form and functional. With a neat boxy shape, top handle and reflective detailing, it’s the perfect everyday companion whether you’re hiking or commuting. And, bonus: it’s a storage solution, thanks to a roll top fastened with two sturdy side release plastic buckles and a sealed front pocket.",
      "Gender":"Men",
      "Category":"Accessories",
      "Subcategory":"Bags & Wallets",
      "Colour":"Black",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991012048804_01",
      "Price":16.0
    },
    {
      "Title":"Regular Fit T-shirt",
      "Subtitle":"This short sleeve tee is an exemplary wardrobe essential",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/regular-fit-t-shirt-cobalt-991049070518",
      "Description":"Not every garment requires all the bells and whistles, sometimes something simple and understated is the way to go. As such, let us introduce you to this regular fit T-shirt. Made from cotton, which boasts a lightweight drape for optimal comfort, this tee is cut to a regular silhouette with a crew neck, straight hem and short sleeves. Use it as a base layer in cooler months, sport solo in spring and summer and enjoy teaming with anything from your favourite jeans to the cosiest of joggers. Your styling options are endless.",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Tops & T-Shirts",
      "Colour":"Cobalt",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991049070518_01",
      "Price":2.5
    },
    {
      "Title":"High-Top Basketball Trainers",
      "Subtitle":"These sporty high-top sneakers are great on or off the court",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/high-top-basketball-trainers-white-991052636002",
      "Description":"Shoes can be the perfect finishing slamdunk when desiring a sporty look, and these trainers could be the option for you. This pair have a simple but effective design that fits well with most athleisure ensembles. Featuring a round toe, they have a lace-up fastening, a rear heel tab, panelling on the upper, and a rubber sole. Pair these kicks with activewear co-ords when going out to play sports, or wear them with your best joggers and shirts for a casual look.",
      "Gender":"Men",
      "Category":"Shoes",
      "Subcategory":"Trainers",
      "Colour":"White",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991052636002_01",
      "Price":18.0
    },
    {
      "Title":"Adjustable Fit Baseball Cap",
      "Subtitle":"If the cap fits 🧢",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/adjustable-fit-baseball-cap-ivory-991027807006",
      "Description":"Our recycled polyester roll-top backpack strikes the right balance between form and functional. With a neat boxy shape, top handle and reflective detailing, it’s the perfect everyday companion whether you’re hiking or commuting. And, bonus: it’s a storage solution, thanks to a roll top fastened with two sturdy side release plastic buckles and a sealed front pocket.",
      "Gender":"Men",
      "Category":"Accessories",
      "Subcategory":"Hats, Gloves & Scarves",
      "Colour":"Ivory",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991027807006_01",
      "Price":3.0
    },
    {
      "Title":"City Printed Basketball Vest",
      "Subtitle":"Hoop on the athleisure trend with this versatile vest!",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/city-printed-basketball-vest-black-991060129804",
      "Description":"Haven’t you heard? The basketball vest is no longer limited to gym sessions and outdoor activities! Thanks to its classic style, this printed vest can form part of an awesome athleisure look that’s totally on trend! Donning a sleek black and white colour scheme, this tee has sporty stripes that are topped with a bold New York print and has contrasting hems for another trendy touch. It’s fashioned from cotton for added breathability and boasts a classic V-neck and shorts sleeves which not only help keep you cool during the summer months but also when you’re out shooting hoops! You can team it with a pair of our basketball shorts for the full sporty outfit, or you can pair it with cargo trousers for a cool everyday ensemble! You shoot, you score!",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Tops & T-Shirts",
      "Colour":"Black",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991060129804_01",
      "Price":8.0
    },
    {
      "Title":"City Printed Basketball Vest",
      "Subtitle":"Hoop on the athleisure trend with this versatile vest!",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/city-printed-basketball-vest-green-991060129414",
      "Description":"Haven’t you heard? The basketball vest is no longer limited to gym sessions and outdoor activities! Thanks to its classic style, this printed vest can form part of an awesome athleisure look that’s totally on trend! Donning a rich green and white colour scheme, this tee has sporty stripes that are topped with a bold Paris print and has contrasting hems for another trendy touch. It’s fashioned from cotton for added breathability and boasts a classic V-neck and shorts sleeves, which not only help keep you cool during the summer months but also when you’re out shooting hoops! You can team it with a pair of our basketball shorts for the full sporty outfit, or you can pair it with cargo trousers for a cool everyday ensemble! You shoot, you score!",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Tops & T-Shirts",
      "Colour":"Green",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991060129414_01",
      "Price":8.0
    },
    {
      "Title":"Cuffed Denim Joggers",
      "Subtitle":"An ideal combination of jeans and joggers for your everyday wardrobe",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/cuffed-denim-joggers-black-991040280804",
      "Description":"Combining the durability of denim with the comfort of joggers, these trousers are a hybrid piece for any lifestyle. The rips at the knees give them a more casual feel that's suitable for hanging out with friends or running everyday errands. The elasticated waistband provides that signature jogger fit that you can adjust with a drawstring. Pair with a favourite T-shirt and overshirt to go out and about, or wear a hoodie for a more relaxed feel.",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Jeans",
      "Colour":"Black",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991040280804_01",
      "Price":20.0
    },
    {
      "Title":"Zip Bomber Jacket",
      "Subtitle":"We can’t get over this classic bomber jacket",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/zip-bomber-jacket-light-blue-991063473504",
      "Description":"Its history may be in aviation, but the zip bomber jacket is now known for its signature streetwear appeal. Our rendition arrives in a pale, powder blue colourway, making it perfect for spring and summer ensembles, while the cotton composition helps the piece to feel more lightweight and breathable. Offering a relaxed fit, the blue jacket features a round jersey collar, central zip fastening, long sleeves with fitted cuffs and two slip pockets, one to either side for a touch of functionality. Lean into the light colour palette by layering this bomber jacket over a white T-shirt and coupling with pale denim.",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Coats & Jackets",
      "Colour":"Light Blue",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991063473504_01",
      "Price":22.0
    },
    {
      "Title":"Long Sleeve Waterproof Raincoat",
      "Subtitle":"Don't let the weather rain on your style parade. Product made using a minimum of 50% Recycled Polyester",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/long-sleeve-waterproof-raincoat-khaki-991053607416",
      "Description":"You don't want to ruin your carefully chosen outfit when it rains, and with this raincoat, you won't have to. Made from a waterproof material, it will keep you dry when the heavens open. The long sleeves and high neckline are designed to cover your clothes for protection, whilst the hood can be put up to keep your hair dry and stop water leaking in. The zip-up front and side pockets let you further secure yourself and your possessions to ensure everything you need arrives safely and dry where needed.",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Coats & Jackets",
      "Colour":"Khaki",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991053607416_01",
      "Price":22.0
    },
    {
      "Title":"Long Sleeve Waterproof Raincoat",
      "Subtitle":"Don't let the weather rain on your style parade. Product made using a minimum of 50% Recycled Polyester",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/long-sleeve-waterproof-raincoat-black-991053607804",
      "Description":"You don't want to ruin your carefully chosen outfit when it rains, and with this raincoat, you won't have to. Made from a waterproof material, it will keep you dry when the heavens open. The long sleeves and high neckline are designed to cover your clothes for protection, whilst the hood can be put up to keep your hair dry and stop water leaking in. The zip-up front and side pockets let you further secure yourself and your possessions to ensure everything you need arrives safely and dry where needed.",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Coats & Jackets",
      "Colour":"Black",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991053607804_01",
      "Price":22.0
    },
    {
      "Title":"The Stronghold Textured Check Overshirt",
      "Subtitle":"The one overshirt your wardrobe is missing",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/the-stronghold-textured-check-overshirt-terracotta-991059717264",
      "Description":"When it comes to shirts, an overshirt is a must in every wardrobe. Worn over a plain white T-shirt, or buttoned up styled with jeans, this Stronghold textured check shirt is ready to make its debut in your everyday wardrobe. The thick woven texture gives it a cosy look, while the red and cream all-over check brings a touch of country chic to your outfit. Featuring long sleeves, chunky button fastenings and two pattern matched pockets on the chest, it boasts a sophisticated style. Team with jeans or chinos for a date night or weekend ready ensemble.Stronghold\nThe Stronghold\n",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Shirts",
      "Colour":"Terracotta",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991059717264_05",
      "Price":25.0
    },
    {
      "Title":"The Stronghold Heritage Denim Jacket",
      "Subtitle":"No wardrobe is complete without a denim jacket!",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/the-stronghold-heritage-denim-jacket-blue-991059716505",
      "Description":"Hold tight, this new light wash denim jacket has just landed from The Stronghold in perfect time to up your spring and summer outfit game. In true The Stronghold form, this jacket has a traditional style with long sleeves, two side pockets, two patch pockets, metal button fastenings and a point collar. Whether you team it with a plain white tee and chinos, or go all out in a double denim ensemble, this jacket will always be on hand to complete your look. Just wait for the compliments to roll in!Stronghold\nThe Stronghold\n",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Coats & Jackets",
      "Colour":"Blue",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991059716505_01",
      "Price":30.0
    },
    {
      "Title":"NFL Miami Dolphins Windbreaker Jacket",
      "Subtitle":"This trendy jacket will be a practical addition to any Miami Dolphins fan’s collection!",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/nfl-miami-dolphins-windbreaker-jacket-green-991063321414",
      "Description":"Fashionable and functional… Those are just two of the words we’d use to describe this NFL windbreaker jacket! Repping the Miami Dolphins’ vibrant orange, white and green colour palette,  this jacket is the perfect way to protect yourself from the elements, while also showing off your sporty style. Thanks to its lightweight feel, it was made to protect you from those sudden showers or strong summer breezes during the warmer months. Designed to offer full coverage, it boasts a toggle hood, long cuffed sleeves and an elasticated hem for a secure fit. Complete with two zip pockets for added functionality, its colour block chevron pattern is bursting with retro vibes that are sure to earn you some style points. Scattered with NFL and Miami Dolphins' iconography, this jacket will have you showcasing your support for this NFL team from every angle! We would suggest teaming it with an oversized tee, jeans and high-top trainers for a stylish ‘80s inspired look!Collection: NFL\nNFL\nNFL\nCharacter: Miami Dolphins\n",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Coats & Jackets",
      "Colour":"Green",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991063321414_01",
      "Price":30.0
    },
    {
      "Title":"The Stronghold Tiger Varsity Jacket",
      "Subtitle":"You’ll look like one cool cat in this tiger motif jacket",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/the-stronghold-tiger-varsity-jacket-orange-991060601260",
      "Description":"Courtesy of The Stronghold, we’re now rocking this tiger varsity jacket! It goes without saying that we couldn’t be happier! Constructed to a signature sporty style with a relaxed silhouette, this bright red jacket features a striped jersey collar, long sleeves with ribbed cuffs and central popper fastenings. A selection of contrasting white motifs are embroidered on the chest, including The Stronghold’s year of establishment, signature branding and hallmark tiger motif, so everyone will know just what LA-based label you’re repping while out and about. Inherently casual, we’d suggest aligning with the style of this sports-infused jacket by teaming with a T-shirt and jeans.Stronghold\nThe Stronghold\n",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Coats & Jackets",
      "Colour":"Orange",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991060601260_01",
      "Price":30.0
    },
    {
      "Title":"Structured Single-Breasted Blazer",
      "Subtitle":"This jacket is equal parts smart and casual",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/structured-single-breasted-blazer-navy-991042412528",
      "Description":"Structured to a classic fit silhouette with darted sides, this single-breasted blazer depicts a signature smart style. However, casual allure finds its way through the piece thanks to the use of a jersey fabric that delivers a delicate dance between the two forms of attire (smart and casual). This dark blazer showcases notch lapels, long sleeves, single-breasted buttons and two jetted front pockets, while a single vent features to the rear. If you’re looking to perfect the relaxed iteration of smart styling, this jacket makes a great go-to.",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Suits & Blazers",
      "Colour":"Navy",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991042412528_01",
      "Price":30.0
    },
    {
      "Title":"Structured Single-Breasted Blazer",
      "Subtitle":"This jacket is equal parts smart and casual",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/structured-single-breasted-blazer-charcoal-991042412716",
      "Description":"Structured to a classic fit silhouette with darted sides, this single-breasted blazer depicts a signature smart style. However, casual allure finds its way through the piece thanks to the use of a jersey fabric that delivers a delicate dance between the two forms of attire (smart and casual). This charcoal grey blazer showcases notch lapels, long sleeves, single-breasted buttons and two jetted front pockets, while a single vent features to the rear. If you’re looking to perfect the relaxed iteration of smart styling, this jacket makes a great go-to.",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Suits & Blazers",
      "Colour":"Charcoal",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991042412716_01",
      "Price":30.0
    },
    {
      "Title":"Kem Sateen Shacket",
      "Subtitle":"We love this fresh take on a casual shacket!",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/kem-sateen-shacket-ecru-991056563108",
      "Description":"Imagine taking something as casual - and at times, utilitarian - as the shacket and imparting a sense of smart structure to it? Sounds rather nice, doesn’t it? Well, courtesy of the latest Kem collection comes this sateen shacket, which does a pretty good job at blurring the boundary between casual, practical aesthetics with semi-smart flair. Crafted from a sateen fabrication, this shirt-jacket hybrid offers a spread collar, single exposed button fastening while the remainder are concealed by a central flap, and long sleeves. For a touch of that functional flair, two patch pockets feature on the chest. We should just give one final mention here, and it has to go to the boxy silhouette, which ensures this Kem sateen shacket presents a structured fit defined by clean lines. You could lean into the smart-casual allure by teaming with tailored trousers or opt for slim fit joggers if you’d just like to elevate a laid-back look.Kem\nKem\n",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Coats & Jackets",
      "Colour":"Ecru",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991056563108_01",
      "Price":35.0
    },
    {
      "Title":"NBA Golden State Warriors Varsity Jacket",
      "Subtitle":"This NBA varsity jacket is a serious score!",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/nba-golden-state-warriors-varsity-jacket-blue-991063324505",
      "Description":"Rendered in the beloved team’s signature colours, the NBA Golden State Warriors varsity jacket is a clear win when it comes to the style stakes. Made from shell with ribbed jersey trims for a classic look, this casual jacket features a striped round neck, popper fastenings down the front and fitted cuffs. White accents separate the shoulder from the long sleeve and further contrasting trims feature by both front slip pockets. Bold Golden State Warriors iconography enlivens the front but it’s the oversized motif, which rests on the back, that really packs a punch. Suffice to say, everyone will know exactly what team you support the moment you step out in this sports-infused jacket!NBA\nNBA\nCharacter: Golden State Warriors\n",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Coats & Jackets",
      "Colour":"Blue",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991063324505_01",
      "Price":35.0
    },
    {
      "Title":"Kem Jacquard Shacket",
      "Subtitle":"This light jacket is cloaked in style",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/kem-jacquard-shacket-black-991064820804",
      "Description":"Courtesy of Kem’s latest drop, this jacquard shacket is the extra layer you didn’t know you needed. It’s a new twist on the contemporary shirt-jacket hybrid, with its textured jacquard fabrication, while the straight, slightly boxy silhouette adds an element that’s reminiscent of retro preppy designs. It’s crafted with a spread collar, large button fastenings and long sleeves, while two patch pockets on the chest and another two slip ones on either side add all-important practicality to the piece. Layer over a simple T-shirt, don a pair of dark jeans and throw on an overcoat for a look that’s as warm as it is stylish.Kem\nKem\n",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Coats & Jackets",
      "Colour":"Black",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991064820804_05",
      "Price":35.0
    },
    {
      "Title":"NBA Los Angeles Lakers Varsity Jacket",
      "Subtitle":"Make the basket, you know you want this varsity jacket",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/nba-los-angeles-lakers-varsity-jacket-black-991063311804",
      "Description":"NBA LA Lakers lovers rejoice! We have the perfect piece for your outerwear repertoire, you lucky thing! Our NBA LA Lakers varsity jacket is loaded with sporty appeal and cut for a casual look, so you can team this layer with anything from jeans to joggers. The design features a classic ribbed collar with contrasting stripes, popper fastenings down the front and a fitted jersey hem, while contrasting white striped detailing rests on the shoulders of the long sleeves, features on the fitted cuffs and frames the two slip pockets on the front for added detail. Multiple NBA LA Lakers embroidery defines the chest and oversized graphics enliven the rear. This is a versatile piece, but for casual flair we love it best when paired with jeans and a T-shirt.NBA\nLA Lakers\nCharacter: LA Lakers\n",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Coats & Jackets",
      "Colour":"Black",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991063311804_01",
      "Price":35.0
    },
    {
      "Title":"Kem Interlock Shacket",
      "Subtitle":"Unlock the key to sartorial prowess with this Kem shacket",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/kem-interlock-shacket-ecru-991064812108",
      "Description":"Lightweight material and a pale colourway unite in this Kem interlock shacket. Harmonising elevated style with a streetwear tinge, this shirt-jacket hybrid (now a staple style in wardrobes everywhere) has been made with spring and summer in mind. It’s part of the latest Kem drop and finds itself shoulder to shoulder with other lightweight designs, pastel hues and laid-back pieces, which all aim to help you effortlessly curate a selection of easy ensembles. This jacket features a spread collar, chest patch pocket and central popper fastenings, while long sleeves with fastened cuffs complete the construction. Slip pockets to the sides offer a touch of practical appeal, truly cementing this style as the cream of the crop (in our opinion, anyway). The best news yet? A pair of matching interlock shorts have been created to couple perfectly with this neutral shacket — just pop a white tee underneath to align with the palette.Kem\nKem\n",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Coats & Jackets",
      "Colour":"Ecru",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991064812108_01",
      "Price":35.0
    },
    {
      "Title":"Kem Basketweave Suit Jacket",
      "Subtitle":"We feel anything but neutral about this Kem jacket",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/kem-basketweave-suit-jacket-beige-991055427118",
      "Description":"Tailored attire has been bang on trend for aeons. This notion still rings true and even in the midst of popular streetwear styles and laid-back looks, signature sartorial ensembles remain a must-have for your wardrobe. So let us present this Kem basketweave suit jacket. Showcasing a sand beige shade, this single-breasted jacket is made with notched lapels, long sleeves with buttoned cuffs and an assortment of pockets: a single chest one and two jetted pockets. Opt for a smart-casual ensemble by pairing this dinner jacket with a T-shirt and chinos, but feel free to stick with tailored trousers and a crisp shirt if true sartorial style is up your street.",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Suits & Blazers",
      "Colour":"Beige",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991055427118_01",
      "Price":40.0
    },
    {
      "Title":"Dogtooth Suit Jacket",
      "Subtitle":"Suit up! In our lovely dogtooth jacket",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/dogtooth-suit-jacket-grey-991055483706",
      "Description":"It’s time to get suited and booted. And let’s be real, of course you’re super well-suited to our dogtooth suit jacket! The lined blazer is defined by minute all-over dogtooth patterning that’s presented in neutral tones to add a preppy and sophisticated touch to the look. The regular fit silhouette offers a structured neckline with subtle notched lapels, while the long sleeve design boasts a single-breasted front, chest welt pocket and two jetted pockets further down. Completed with a rear vent for flexible wear, all you need to do is team this blazer with tailored trousers and perhaps a nice pair of brogues to enjoy a polished ensemble!",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Suits & Blazers",
      "Colour":"Grey",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991055483706_01",
      "Price":40.0
    },
    {
      "Title":"Checked Regular Fit Suit Jacket",
      "Subtitle":"Smart occasions on the horizon? Turn to this single-breasted suit jacket",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/checked-regular-fit-suit-jacket-grey-991038870706",
      "Description":"Seeking out a sublime sartorial style? Our checked regular fit suit jacket might be just what you need. Delivering a look with all the hallmarks you’d expect from a tailored blazer, like a structured silhouette, notched lapels and long sleeves, this check jacket is all kinds of classic and we love it. The piece is secured by single-breasted button fastenings, while one welt pocket features on the chest and two jetted pockets are included further down the style for added functionality. A rear vent finalises the design to assist with flexible wear and easy movement. Given the, albeit subtle, check print that covers this blazer, we’d suggest keeping everything else understated with a crisp shirt and single colour tie.",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Suits & Blazers",
      "Colour":"Grey",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991038870706_01",
      "Price":40.0
    },
    {
      "Title":"Kem Lightweight Single-Breasted Suit Jacket",
      "Subtitle":"Put a spring in your sartorial step with this lightweight blazer",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/kem-lightweight-single-breasted-suit-jacket-light-green-991064722413",
      "Description":"Tailoring shouldn’t be confined to certain bouts of weather - in our opinion flattering sartorial silhouettes belong in the fashion sphere all year round! So, fear not, when the weather warms up and you’re looking for a lightweight and incredibly dashing smart ensemble, look no further than this Kem single-breasted suit jacket. Part of his spring collection, this blazer is crafted from light material and even boasts a pale cream colourway. It’s structured with notched lapels and long sleeves, while tonal single-breasted button fastenings keeps the look clean and classic. A single jetted pocket rests on the left of the chest and two more can be found further down for added functionality, and to finish, a single vent to back helps ensure comfortable wear and easy movement. Maybe this will be your first sartorial taste for spring!Kem\nKem\n",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Suits & Blazers",
      "Colour":"Light Green",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991064722413_01",
      "Price":50.0
    },
    {
      "Title":"Kem Double-Breasted Seersucker Suit Jacket",
      "Subtitle":"There’s nothing quite as classic as a double-breasted jacket",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/kem-double-breasted-seersucker-suit-jacket-black-991064792804",
      "Description":"The Kem collection never ceases to amaze and delight (us and you, that is!) and we can prove it with this Kem double-breasted seersucker suit jacket. It screams classic all thanks to its dark colourway and structured silhouette. Having said that, of course there’s a little contemporary twist with the textured seersucker fabrication, an element we’ve truly fallen head over heels for. The piece is further created with subtle peak lapels, long sleeves with buttoned cuffs and double-breasted button fastenings to the front, while a welt pocket on the chest and two further pockets also feature. Keep the ensemble suave and sophisticated by coupling this black jacket with tailored trousers for a sleek sartorial look.Kem\nKem\n",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Suits & Blazers",
      "Colour":"Black",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991064792804_05",
      "Price":50.0
    },
    {
      "Title":"Kem Checked Suit Jacket",
      "Subtitle":"A linen and cotton blend jacket for warm weather occasions",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/kem-checked-suit-jacket-grey-991064853706",
      "Description":"Leave it to Kem Cetinay to ensure we can take tailoring into the summertime, hey! Part of his latest drop, this Kem checked suit jacket is riddled with all the sartorial cues you’d expect from a tailored jacket, all while imbuing the style with elements that make it optimal for warm weather occasions. First and foremost, the structured piece is cut to a regular fit and made from a linen and cotton blend, which helps to add a lightweight and breathable feel to the blazer. It offers classic notched lapels, single-breasted button fastenings and long sleeves. A single jetted pocket features on the chest and a further two are included for an extra touch of functionality. Keep things coordinated by pairing this neutral suit jacket with the matching trousers.Kem\nKem\n",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Suits & Blazers",
      "Colour":"Grey",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991064853706_01",
      "Price":50.0
    },
    {
      "Title":"Kem Lightweight Suit Jacket",
      "Subtitle":"A single-breasted suit jacket that’s perfect for spring and summer",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/kem-lightweight-suit-jacket-khaki-991067700416",
      "Description":"Part of the Kem spring collection, this lightweight suit jacket is the thing that’ll have you scoring all the style points at your next hurrah. Signature sartorial flair characterises the design, which is crafted with notch lapels, long sleeves and single-breasted button fastenings. A welt pocket on the chest and two jetted pockets to the front offer a touch of practical appeal, while the linen-blend fabrication helps to deliver lightweight and breathable wear for optimal comfort in warmer seasons. Opt for a classic black shirt beneath to keep within the dark and moody colour palette of this deep green suit jacket.Kem\nKem\n",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Suits & Blazers",
      "Colour":"Khaki",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991067700416_01",
      "Price":50.0
    },
    {
      "Title":"Kem Lightweight Suit Jacket",
      "Subtitle":"Enjoy summertime tailoring at its finest with this single-breasted jacket",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/kem-lightweight-suit-jacket-ecru-991067704108",
      "Description":"Part of the Kem spring collection, this lightweight suit jacket is the thing that’ll take you from outdoor dining in the afternoon sun to dancing like no one’s watching at a summertime evening bash. Signature sartorial flair characterises the design, which is crafted with notch lapels, long sleeves and single-breasted button fastenings. A welt pocket on the chest and two jetted pockets to the front offer a touch of practical appeal, while the linen-blend fabrication helps to deliver lightweight and breathable wear for optimal comfort. Pair with matching trousers from the Kem range and sport a classic white shirt beneath to keep within the neutral colour palette of this cream suit jacket.Kem\nKem\n",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Suits & Blazers",
      "Colour":"Ecru",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991067704108_01",
      "Price":50.0
    },
    {
      "Title":"Kem Lightweight Single-Breasted Suit Jacket",
      "Subtitle":"Put a spring in your sartorial step with this lightweight blazer",
      "Url":"https:\/\/www.primark.com\/en-gb\/p\/kem-lightweight-single-breasted-suit-jacket-lilac-991064722556",
      "Description":"Tailoring shouldn’t be confined to certain bouts of weather — in our opinion, flattering and smart silhouettes belong in the fashion sphere all year round! So, fear not, when the weather warms up and you’re looking for a lightweight and incredibly dashing formal ensemble, look no further than this Kem single-breasted suit jacket. Part of the spring collection, this blazer is crafted from light material and even boasts a pastel colourway. It’s structured with notched lapels and long sleeves, while tonal single-breasted button fastenings keep the look clean and classic. A single jetted pocket rests to the left chest and two more can be found further down for added functionality, while to finish, a single vent at the back helps ensure comfortable wear and easy movement. Maybe this will be your first tailored taste for spring?Kem\nKem\n",
      "Gender":"Men",
      "Category":"Clothing",
      "Subcategory":"Suits & Blazers",
      "Colour":"Lilac",
      "Image":"https:\/\/cdn.media.amplience.net\/i\/primark\/991064722556_01",
      "Price":50.0
    }
  ]